[
  {
    "id": "ff4ac5b2-4ce6-415d-b1e6-dfaa3928d5fe",
    "jiraId": "NAFAMZ-54899",
    "summary": "Watto :: Fix RING Transaction stream to consume Mandalorian bonuses transactions correctly",
    "description": "",
    "cenarios": [
      "1. Cenário de teste: Verificar se a transmissão de transações do RING está consumindo as transações de bônus do Mandalorian corretamente.\n   - Passos:\n     1. Acessar o sistema RING.\n     2. Realizar transações de bônus do Mandalorian.\n     3. Verificar se as transações estão sendo consumidas corretamente pela transmissão do RING.\n     4. Verificar se as transações de bônus estão sendo registradas corretamente no sistema.",
      "Cenário de teste: Verificar se as transações de bônus do Mandalorian estão sendo exibidas corretamente na interface do usuário.\n   - Passos:\n     1. Acessar a interface do usuário do sistema RING.\n     2. Verificar se as transações de bônus do Mandalorian estão sendo exibidas corretamente.\n     3. Verificar se as informações das transações estão corretas, como valores, datas e descrições.",
      "Cenário de teste: Verificar se a integração entre o RING e o sistema de transações do Mandalorian está funcionando corretamente.\n   - Passos:\n     1. Realizar transações no sistema do Mandalorian.\n     2. Verificar se as transações são corretamente enviadas para o RING.\n     3. Verificar se as transações são corretamente processadas e registradas no RING.",
      "Cenário de teste: Verificar se a performance da transmissão de transações do RING não é impactada pelas transações de bônus do Mandalorian.\n   - Passos:\n     1. Realizar um grande volume de transações de bônus do Mandalorian.\n     2. Verificar se a transmissão de transações do RING continua funcionando sem impactos na performance.\n     3. Verificar se não há atrasos ou interrupções na transmissão de transações.",
      "Cenário de teste: Verificar se as transações de bônus do Mandalorian são devidamente categorizadas e registradas no RING.\n   - Passos:\n     1. Realizar transações de bônus do Mandalorian com diferentes categorias.\n     2. Verificar se as transações são corretamente"
    ],
    "dataCriacao": "2025-07-16T14:16:14.936Z",
    "dataAtualizacao": "2025-07-16T14:16:14.936Z"
  },
  {
    "id": "1847903c-bb68-4299-a452-f632a184416e",
    "jiraId": "NAFAMZ-54899",
    "summary": "Watto :: Fix RING Transaction stream to consume Mandalorian bonuses transactions correctly",
    "description": "",
    "cenarios": [
      "1. Cenário de teste: Verificar se o sistema está recebendo corretamente as transações de bônus do Mandalorian.\n   - Passos:\n      1. Realizar uma transação de bônus do Mandalorian.\n      2. Verificar se a transação foi recebida corretamente no sistema.\n      3. Verificar se o valor da transação está correto.\n      4. Verificar se a transação foi registrada corretamente no histórico de transações.",
      "Cenário de teste: Verificar se o sistema está processando corretamente as transações de bônus do Mandalorian.\n   - Passos:\n      1. Realizar uma transação de bônus do Mandalorian.\n      2. Verificar se a transação foi processada corretamente pelo sistema.\n      3. Verificar se o saldo do usuário foi atualizado corretamente após a transação de bônus.\n      4. Verificar se o status da transação no sistema está correto.",
      "Cenário de teste: Verificar se o sistema está gerando corretamente os relatórios de transações de bônus do Mandalorian.\n   - Passos:\n      1. Realizar várias transações de bônus do Mandalorian.\n      2. Gerar um relatório de transações de bônus do Mandalorian.\n      3. Verificar se todas as transações realizadas estão listadas no relatório.\n      4. Verificar se os valores das transações estão corretos no relatório.",
      "Cenário de teste: Verificar se o sistema está integrado corretamente com o fluxo de transações do Mandalorian.\n   - Passos:\n      1. Simular uma transação de bônus do Mandalorian.\n      2. Verificar se a transação é recebida corretamente pelo sistema.\n      3. Verificar se a transação é processada corretamente pelo sistema.\n      4. Verificar se o sistema está enviando corretamente as informações de transação para o Mandalorian.",
      "Cenário de teste: Verificar se o sistema está lidando corretamente com cenários de erro nas transações de bônus do Mandalorian.\n   - Passos:\n      1. Realizar uma transação de bôn"
    ],
    "dataCriacao": "2025-07-16T14:20:03.336Z",
    "dataAtualizacao": "2025-07-16T14:20:03.336Z"
  },
  {
    "id": "94b5016b-0488-40c9-95d6-f5c58ad2a036",
    "jiraId": "NAFAMZ-54899",
    "summary": "Watto :: Fix RING Transaction stream to consume Mandalorian bonuses transactions correctly",
    "description": "<p>dev  to adjust the RING Transaction stream    we can consume Mandalorian bonuses  transactions correctly In JForce we need to consume the transactions generated from Bonus's rewards, but we are receiving a error when we decode the transaction payload because the bonusMatchID has the wrong type. We need to fix this to store this kind of transactions correctly. <b>Problem sample:</b> <a>Opensearch logs</a> <span><$><class>image-wrap</class><style></style></$><a><$><id>1104008_thumb</id><href>https://jira.jumia.com/secure/attachment/1104008/1104008_Screenshot+from+2025-01-20+16-11-49.png</href><title>Screenshot from 2025-01-20 16-11-49.png</title><file-preview-type>image</file-preview-type><file-preview-id>1104008</file-preview-id><file-preview-title>Screenshot from 2025-01-20 16-11-49.png</file-preview-title></$><img><$><src>https://jira.jumia.com/secure/thumbnail/1104008/_thumb_1104008.png</src><style>border: 0px solid black</style><role>presentation</role></$></img></a></span> : this is not affecting the amount of money received by the JForce agent, but only the value displayed inside of JForce services. We properly store Mandalorian bonuses transactions.</p><h2>Background information Acceptance Criteria</h2>",
    "cenarios": [
      "1. Cenário de teste: Verificar se o payload da transação está sendo decodificado corretamente para o tipo de bonusMatchID adequado.\n   - Passos:\n     1. Realizar uma transação de bônus de Mandalorian no sistema.\n     2. Verificar se o bonusMatchID está sendo armazenado corretamente no payload da transação.\n     3. Confirmar se a transação é armazenada corretamente no sistema.",
      "Cenário de teste: Verificar se o valor das transações de bônus de Mandalorian está sendo exibido corretamente nos serviços do JForce.\n   - Passos:\n     1. Realizar transações de bônus de Mandalorian no sistema.\n     2. Verificar se o valor das transações é exibido corretamente nos serviços do JForce.\n     3. Confirmar se o valor exibido corresponde ao valor real das transações.",
      "Cenário de teste: Verificar se os bônus de Mandalorian estão sendo armazenados corretamente no sistema.\n   - Passos:\n     1. Gerar múltiplas transações de bônus de Mandalorian no sistema.\n     2. Verificar se todas as transações de bônus são armazenadas corretamente no sistema.\n     3. Confirmar se o sistema é capaz de armazenar e exibir corretamente os bônus de Mandalorian.",
      "Cenário de teste: Verificar se as transações de bônus estão sendo corretamente processadas pelo RING.\n   - Passos:\n     1. Realizar transações de bônus no sistema.\n     2. Verificar se as transações são processadas corretamente pelo RING.\n     3. Confirmar se os usuários estão recebendo os bônus adequadamente após o processamento no RING.",
      "Cenário de teste: Verificar se as transações de bônus estão sendo exibidas corretamente no menu de bônus do usuário.\n   - Passos:\n     1. Realizar transações de bônus no sistema.\n     2. Verificar se todas as transações de bônus são exibidas corretamente no menu de bônus do usuário.\n     3. Confirmar se o"
    ],
    "dataCriacao": "2025-07-17T12:10:22.911Z",
    "dataAtualizacao": "2025-07-17T12:10:22.911Z"
  },
  {
    "id": "83d23220-b0c6-454b-91d9-955b2299db3c",
    "jiraId": "NAFAMZ-54899",
    "summary": "Watto :: Fix RING Transaction stream to consume Mandalorian bonuses transactions correctly",
    "description": "<p>dev  to adjust the RING Transaction stream    we can consume Mandalorian bonuses  transactions correctly In JForce we need to consume the transactions generated from Bonus's rewards, but we are receiving a error when we decode the transaction payload because the bonusMatchID has the wrong type. We need to fix this to store this kind of transactions correctly. <b>Problem sample:</b> <a>Opensearch logs</a> <span><$><class>image-wrap</class><style></style></$><a><$><id>1104008_thumb</id><href>https://jira.jumia.com/secure/attachment/1104008/1104008_Screenshot+from+2025-01-20+16-11-49.png</href><title>Screenshot from 2025-01-20 16-11-49.png</title><file-preview-type>image</file-preview-type><file-preview-id>1104008</file-preview-id><file-preview-title>Screenshot from 2025-01-20 16-11-49.png</file-preview-title></$><img><$><src>https://jira.jumia.com/secure/thumbnail/1104008/_thumb_1104008.png</src><style>border: 0px solid black</style><role>presentation</role></$></img></a></span> : this is not affecting the amount of money received by the JForce agent, but only the value displayed inside of JForce services. We properly store Mandalorian bonuses transactions.</p><h2>Background information Acceptance Criteria</h2>",
    "cenarios": [
      "1. Cenário de teste: Verificar se o stream de transações RING está consumindo corretamente as transações de bônus Mandalorian.\n   - Passos:\n     1. Realizar transações de bônus Mandalorian.\n     2. Verificar se as transações estão sendo corretamente consumidas pelo stream de transações RING.\n     3. Verificar se o bonusMatchID está sendo armazenado corretamente.\n   - Critérios de aceitação: As transações de bônus Mandalorian devem ser corretamente consumidas e armazenadas pelo stream de transações RING.",
      "Cenário de teste: Verificar se o valor exibido dentro dos serviços JForce está correto para as transações de bônus Mandalorian.\n   - Passos:\n     1. Realizar transações de bônus Mandalorian.\n     2. Verificar se o valor exibido dentro dos serviços JForce reflete corretamente as transações de bônus Mandalorian.\n   - Critérios de aceitação: O valor exibido dentro dos serviços JForce deve corresponder corretamente às transações de bônus Mandalorian.",
      "Cenário de teste: Verificar se as transações de bônus estão sendo corretamente armazenadas.\n   - Passos:\n     1. Realizar transações de bônus.\n     2. Verificar se as transações de bônus estão sendo corretamente armazenadas no sistema.\n   - Critérios de aceitação: As transações de bônus devem ser corretamente armazenadas no sistema.",
      "Cenário de teste: Verificar se os usuários estão recebendo a quantidade correta de recompensas de bônus.\n   - Passos:\n     1. Atribuir recompensas de bônus aos usuários.\n     2. Verificar se os usuários estão recebendo a quantidade correta de recompensas de bônus.\n   - Critérios de aceitação: Os usuários devem receber a quantidade correta de recompensas de bônus.",
      "Cenário de teste: Verificar se as transações de bônus estão sendo corretamente processadas pelo sistema RING.\n   - Passos:\n     1"
    ],
    "dataCriacao": "2025-07-17T12:17:15.370Z",
    "dataAtualizacao": "2025-07-17T12:17:15.370Z"
  }
]